//Array of object

const quiz=[
    {
        q: 'ශ්‍රී ලංකාවේ මාර්ග නීති සංග්‍රහයේ  අනතුරු ඇගවීමේ සංඥා දක්වා ඇත්තේ',
        options:['නිල් පසුබිමෙහි සුදු වර්ණයෙනි','රතු පසුබිමෙහි සුදු වර්ණයෙනි',
        'කහ පසුබිමෙහි කළු වර්ණයෙනි','සුදු  පසුබිමෙහි රතු  වර්ණයෙනි'],
        answer:2
    },
    {
        q:'වටරවුමක මූලික නීතිය වන්නේ ',
        options:['ඔබට දකුණෙන් පැමිණෙන වාහන වලට ඉඩ දිය යුතුය',
        'ඔබට වම් පසින් හෝ අසන්නයෙන් පැමිණෙන වාහන වලට ඉඩ දිය යුතුය ',
        'අධික රථවාහන තදබදයක් සහිත දිශාවෙන් පැමිණෙන රථවාහන වලට ඉඩ දිය යුතුය','ඔබට වම් පසින් හෝ අසන්නව දකුණෙන් පැමිණෙන වාහන වලට ඉඩ දිය යුතුය'],
        answer:0

    },
    {
        q:'එක් දිශාවකට මං තීරු තුනක් සහිත මාර්ගයක ඔබගේ වාහනය ඉදිරියට ගමන් කරන අවස්ථාවකදී ඔබ විසින් තෝරාගත යුතු මං තීරු වනුයේ ',
        options:['මාර්ගයේ මැද තීරුව හෝ දකුණු පස මං තීරුවය','මාර්ගයේ දකුණු පස මං තීරුවය','මාර්ගයේ වම්  පස මං තීරුවය',
        'මාර්ගයේ මැද තීරුව'],
        answer:3

    },
    {
        q:'ඔබගේ වාහනය සහ ඔබට ඉදිරියෙන් ධාවනය වන වාහනය අතර ප්‍රමාණවත් දුරක් තබාගත යුත්තේ ',
        options:['ඔබට ඉදිරියෙන් ධාවනය වන වාහනයේ  රියදුරු හදිස්සියේ නතරකලහොත් ,එම වාහනය පසුකර යාමට ඔබට වැඩි වේලාවක් ලැබෙන නිසාය',
        'ඔබට ඉදිරියෙන් ධාවනය වන වාහනයේ  රියදුරු හදිස්සියේ නතරකලහොත්,ඔබට ඔබගේ වාහනය ආරක්ශාකාරී ලෙස නතර කර ගැනීමට හැකි වන නිසාය ',
        'ඔබට ඉදිරියෙන් ධාවනය වන වාහනය ඉස්සර කිරීමට වැඩි ඉඩක් ලැබෙන නිසාය','ඔබට ඉදිරියෙන් ධාවනය වන වාහනය පසුපසින්  ධාවනය කිරීම වඩාත් පහසු වන නිසාය'],
        answer:1
    },
    {
        q:'වාහනයක අවදානම හැඟවීමේ ලාම්පු (Hazard Lamps) පාවිච්චි කලයුත්තේ ,',
        options:['වාහනය අබලන් තත්වයකට පත්ව නවතා තිබියදී පමණි','වාහනයක් හදිසි තත්වයක් නිසා ධාවනයකරන බව දැක්වීම සඳහා','හන්දියකදී වාහනයක් කෙළින්ම ධා වනයකිරීමට අදහස් කරන අවස්තාවේදී ','ප්‍රමුඛතාවය ලබාගැනීම සඳහා'],
        answer:0
    },
    {
        q:'වෙනත් වාහනයක් විසින් ඔබගේ වාහනය  පසු කර යන අස්තවකදී ,',
        options:['ඔබ පසුකර යාමට ඉඩ දීමට  අකැමැති නම් ඔබගේ වාහනයේ දකුණු පස සංඥා දැල්විය යුතුයි', 
        'ඔබගේ වාහනය අඩු ගියරයකට යොදා නතරකිරීමට සූදානම් විය යුතුයි',
        'ඔබගේ වාහනය වේගය වැඩි නොකර පසුකරන්නාට ඔබගේ වාහනය පසුකර යාමට ඉඩ දිය යුතුය', 
        'ඔබ පසුකර යාමට ඉඩ දීමට කැමැත්තක් නොදක්වන්නෙ නම් ඔබට වාහනයේ වේගය වැඩි කල හැක'],
        answer:2
    },
    {
        q:'මංසන්ධි කොටුවේ සලකුණු කර ඇති ස්ථානයකදී ,',
        options:['ඔබ කෙළින්ම ඉදිරියට ගමන් කරන්නේ නම් ඔබට මංසන්ධි කොටුව තුලට ඇතුල් විය හැකිය', 
            'දකුණට හැරවීමේදී  හැර පිටවීමට ඇති මාර්ගය අවහිර නම් මංසන්ධි කොටුව තුලට ඇතුල් නොවිය යුතුය', 
            'දකුණට හැරවීමේදී  හැර ඕනෑම අවස්ථාවකදී  ඔබට මංසන්ධි කොටුව තුළට ඇතුල් විය හැකිය',
            'ඕනෑම අවස්ථාවකදී ඔබට  මංසන්ධි කොටුව තුලට ඇතුල් විය හැකිය'],
        answer:1
    },
    {
        q:'වාහනයක් නතර කර තැබිය හැකි ස්ථානයක් වන්නේ ',
        options:['මං සන්ධියක සිට මීටර 25 ක සීමාවෙන් පිටතය', 
            'බස්රථ නැවතුමක සිට  මීටර 20 ක සීමාවෙන් පිටතය',
            'පදික  මාරුවක දඟර ප්‍රදේශයේ හෝ එහි සිට  මීටර  10 ක සීමාවෙන්  පිටතය', 
            'ගිනි නිවන ජලනලයක සිට මීටර 10 ක සීමාවෙන් පිටතය'],
        answer: 2  
    }
]